# DataFrame

In [7]:
import numpy as np
import pandas as pd

In [8]:
from numpy.random import randn

In [9]:
np.random.seed(101)

In [10]:
df = pd.DataFrame(data=randn(5,4),index = ['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
#here each column in panda series

In [23]:
df['W']#get a column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
type(df)

pandas.core.frame.DataFrame

In [12]:
#
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
#multiple columns

In [17]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [18]:
#create a new col

In [19]:
df['new'] = df['W'] + df['Z']

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df['new1'] = [1,2,3,4,5]

In [29]:
df

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [32]:
df.drop(columns='new1', inplace=True)

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.drop('new1') #error, change the axis from 0  to 1

KeyError: "['new1'] not found in axis"

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.drop('new1',axis=1)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [35]:
df

          W         X         Y         Z       new  new1
A  2.706850  0.628133  0.907969  0.503826  3.210676     1
B  0.651118 -0.319318 -0.848077  0.605965  1.257083     2
C -2.018168  0.740122  0.528813 -0.589001 -2.607169     3
D  0.188695 -0.758872 -0.933237  0.955057  1.143752     4
E  0.190794  1.978757  2.605967  0.683509  0.874303     5

In [36]:

#all the dropped column remained

In [38]:
df.drop('new',axis=1,inplace=True)

In [39]:
df

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [40]:
#drop rows

In [41]:
df.drop('E')

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4

In [42]:
df.shape

(5, 5)

In [43]:
#Selecting rows

In [44]:
df

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [45]:
df.loc['A']

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new1    1.000000
Name: A, dtype: float64

In [46]:
df.loc['C']

W      -2.018168
X       0.740122
Y       0.528813
Z      -0.589001
new1    3.000000
Name: C, dtype: float64

In [47]:
#or
df.iloc[2]

W      -2.018168
X       0.740122
Y       0.528813
Z      -0.589001
new1    3.000000
Name: C, dtype: float64

In [48]:
#subsets of rows and columns

In [49]:
df.loc['B','Y']

-0.8480769834036315

In [50]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [51]:
#Conditional Selection

In [52]:
df > 0

       W      X      Y      Z  new1
A   True   True   True   True  True
B   True  False  False   True  True
C  False   True   True  False  True
D   True  False  False   True  True
E   True   True   True   True  True

In [53]:
booldf = df > 0

In [54]:
booldf

       W      X      Y      Z  new1
A   True   True   True   True  True
B   True  False  False   True  True
C  False   True   True  False  True
D   True  False  False   True  True
E   True   True   True   True  True

In [55]:

df[booldf]

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118       NaN       NaN  0.605965     2
C       NaN  0.740122  0.528813       NaN     3
D  0.188695       NaN       NaN  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [56]:

df[df > 0]

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118       NaN       NaN  0.605965     2
C       NaN  0.740122  0.528813       NaN     3
D  0.188695       NaN       NaN  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [58]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [59]:
df[df['W']>0]

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [60]:
#subset df where W > 0 and then select column X

In [61]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [62]:
#multiple conditions

In [67]:
df[(df['W']>0) & (df['Y'] > 0)]  #for or | pipe operator

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
E  0.190794  1.978757  2.605967  0.683509     5

In [68]:
#index

In [69]:
#reseting index

In [70]:
df

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [35]:

df.reset_index() #old index becomes the column of the data frame

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [47]:
df.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [50]:
df.index = df['index']

In [53]:
df.drop(['level_0','index'],axis=1,inplace=True)

In [54]:
df

              W         X         Y         Z
index
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509

In [49]:
df

       level_0 index         W         X         Y         Z
index
A            0     A  2.706850  0.628133  0.907969  0.503826
B            1     B  0.651118 -0.319318 -0.848077  0.605965
C            2     C -2.018168  0.740122  0.528813 -0.589001
D            3     D  0.188695 -0.758872 -0.933237  0.955057
E            4     E  0.190794  1.978757  2.605967  0.683509

In [46]:
df

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [75]:
#permanent change
#df.reset_index(inplace=True)

In [76]:
df

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [77]:
newind = 'CA NY WY OR CO'.split()

In [78]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [79]:
df['States'] = newind

In [80]:
df

          W         X         Y         Z  new1 States
A  2.706850  0.628133  0.907969  0.503826     1     CA
B  0.651118 -0.319318 -0.848077  0.605965     2     NY
C -2.018168  0.740122  0.528813 -0.589001     3     WY
D  0.188695 -0.758872 -0.933237  0.955057     4     OR
E  0.190794  1.978757  2.605967  0.683509     5     CO

In [81]:

#i want my column as index

In [82]:
df.set_index('States')

               W         X         Y         Z  new1
States
CA      2.706850  0.628133  0.907969  0.503826     1
NY      0.651118 -0.319318 -0.848077  0.605965     2
WY     -2.018168  0.740122  0.528813 -0.589001     3
OR      0.188695 -0.758872 -0.933237  0.955057     4
CO      0.190794  1.978757  2.605967  0.683509     5

In [83]:

df

          W         X         Y         Z  new1 States
A  2.706850  0.628133  0.907969  0.503826     1     CA
B  0.651118 -0.319318 -0.848077  0.605965     2     NY
C -2.018168  0.740122  0.528813 -0.589001     3     WY
D  0.188695 -0.758872 -0.933237  0.955057     4     OR
E  0.190794  1.978757  2.605967  0.683509     5     CO

In [85]:
#Multi Index and Index Hierarchy

In [57]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,1]

In [59]:
hier_index = list(zip(outside,inside))

In [60]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 1)]

In [61]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [62]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 0]])

In [63]:
df = pd.DataFrame(randn(6,2),index=hier_index,columns=['A','B'])

In [93]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [94]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [95]:
df.index.names = ['Groups','Num']

In [96]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [97]:
#grab 0.072960
df.loc['G2'].loc[2][1]

0.07295967531703869

In [98]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [99]:
#cross section

In [100]:
#grab all under G1

In [101]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [102]:
#all data under 1 both group

In [104]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502